# TextBoxEnterPressedEventArgs Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextBoxEnterPressedEventArgs Constructor
TextBoxEnterPressedEventArgs Class See Also
---
Initializes a new instance of the TextBoxEnterPressedEventArgs class
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TextBoxEnterPressedEventArgs()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TextBoxEnterPressedEventArgs()
```

# See Also
TextBoxEnterPressedEventArgs Class
Autodesk.Revit.UI.Events Namespace